# PathFailures Properties

---
The BuiltInFailuresPathFailures type exposes the following members.
| Name| Description
---|---|---
| Path3dRegenError|  Picked Path could not be regenerated.
Top
#### Reference
BuiltInFailuresPathFailures Class
Autodesk.Revit.DB Namespace